TelemetryTimmy/Telemetry20/tirtos_builds_CC1352P1_LAUNCHXL_release_ccs/Debug/configPkg/package/cfg/release_pem4f.c
/* xdcRomConstPtr */
#ifdef __ti__sect
#pragma DATA_SECTION(xdcRomConstPtr, ".data:xdcRomConstPtr");
#elif defined(__GNUC__) && !(defined(__MACH__) && defined(__APPLE__))
    #ifndef __ti__
const xdc_UInt8 * xdcRomConstPtr __attribute__ ((section(".data_xdcRomConstPtr")));
    #elif defined(__clang__)
const xdc_UInt8 * xdcRomConstPtr __attribute__ ((section(".data:xdcRomConstPtr")));
    #endif
#endif
#if defined (__IAR_SYSTEMS_ICC__)
#pragma location = ".data_xdcRomConstPtr"
#endif
const xdc_UInt8 * xdcRomConstPtr = (xdc_UInt8 *)&ROM_constStruct;

/* xdcRomStatePtr */
#ifdef __ti__sect
#pragma DATA_SECTION(xdcRomStatePtr, ".data:xdcRomStatePtr");
#elif defined(__GNUC__) && !(defined(__MACH__) && defined(__APPLE__))
    #ifndef __ti__
xdc_UInt8 * xdcRomStatePtr __attribute__ ((section(".data_xdcRomStatePtr")));
    #elif defined(__clang__)
xdc_UInt8 * xdcRomStatePtr __attribute__ ((section(".data:xdcRomStatePtr")));
    #endif
#endif
#if defined (__IAR_SYSTEMS_ICC__)
#pragma location = ".data_xdcRomStatePtr"
#endif
xdc_UInt8 * xdcRomStatePtr = (xdc_UInt8 *)&ROM_stateStruct;


/*
 * ======== xdc.runtime.IGateProvider VIRTUAL FUNCTIONS ========
 */

/* create */
xdc_runtime_IGateProvider_Handle xdc_runtime_IGateProvider_create( xdc_runtime_IGateProvider_Module mod, const xdc_runtime_IGateProvider_Params *prms, xdc_runtime_Error_Block *eb )
{
    return (xdc_runtime_IGateProvider_Handle) mod->__sysp->__create(0, (const xdc_UChar*)prms, sizeof (xdc_runtime_IGateProvider_Params), eb);
}

/* delete */
void xdc_runtime_IGateProvider_delete( xdc_runtime_IGateProvider_Handle *instp )
{
    (*instp)->__fxns->__sysp->__delete(instp);
}


/*
 * ======== xdc.runtime.IHeap VIRTUAL FUNCTIONS ========
 */

/* create */
xdc_runtime_IHeap_Handle xdc_runtime_IHeap_create( xdc_runtime_IHeap_Module mod, const xdc_runtime_IHeap_Params *prms, xdc_runtime_Error_Block *eb )
{
    return (xdc_runtime_IHeap_Handle) mod->__sysp->__create(0, (const xdc_UChar*)prms, sizeof (xdc_runtime_IHeap_Params), eb);
}

/* delete */
void xdc_runtime_IHeap_delete( xdc_runtime_IHeap_Handle *instp )
{
    (*instp)->__fxns->__sysp->__delete(instp);
}


/*
 * ======== ti.sysbios.family.arm.cc26xx.Boot SYSTEM FUNCTIONS ========
 */

/* Module__startupDone__S */
xdc_Bool ti_sysbios_family_arm_cc26xx_Boot_Module__startupDone__S( void )
{
    return 1;
}



/*
 * ======== ti.sysbios.family.arm.cc26xx.Seconds SYSTEM FUNCTIONS ========
 */

/* Module__startupDone__S */
xdc_Bool ti_sysbios_family_arm_cc26xx_Seconds_Module__startupDone__S( void )
{
    return 1;
}



/*
 * ======== ti.sysbios.family.arm.m3.IntrinsicsSupport SYSTEM FUNCTIONS ========
 */

/* Module__startupDone__S */
xdc_Bool ti_sysbios_family_arm_m3_IntrinsicsSupport_Module__startupDone__S( void )
{
    return 1;
}



/*
 * ======== ti.sysbios.hal.Seconds SYSTEM FUNCTIONS ========
 */

/* Module__startupDone__S */
xdc_Bool ti_sysbios_hal_Seconds_Module__startupDone__S( void )
{
    return 1;
}



/*
 * ======== ti.sysbios.hal.Seconds_SecondsProxy SYSTEM FUNCTIONS ========
 */


xdc_Bool ti_sysbios_hal_Seconds_SecondsProxy_Proxy__abstract__S(void)
{
    return 0;
}
xdc_CPtr ti_sysbios_hal_Seconds_SecondsProxy_Proxy__delegate__S(void)
{
    return (const void *)&ti_sysbios_family_arm_cc26xx_Seconds_Module__FXNS__C;
}



/*
 * ======== ti.sysbios.heaps.HeapTrack SYSTEM FUNCTIONS ========
 */

/* per-module runtime symbols */
#undef Module__MID
#ifdef ti_sysbios_heaps_HeapTrack_Module__id__CR
#define Module__MID (*((CT__ti_sysbios_heaps_HeapTrack_Module__id *)(xdcRomConstPtr + ti_sysbios_heaps_HeapTrack_Module__id__C_offset)))
#else
#define Module__MID ti_sysbios_heaps_HeapTrack_Module__id__C
#endif

#undef Module__DGSINCL
#ifdef ti_sysbios_heaps_HeapTrack_Module__diagsIncluded__CR
#define Module__DGSINCL (*((CT__ti_sysbios_heaps_HeapTrack_Module__diagsIncluded *)(xdcRomConstPtr + ti_sysbios_heaps_HeapTrack_Module__diagsIncluded__C_offset)))
#else
#define Module__DGSINCL ti_sysbios_heaps_HeapTrack_Module__diagsIncluded__C
#endif

#undef Module__DGSENAB
#ifdef ti_sysbios_heaps_HeapTrack_Module__diagsEnabled__CR
#define Module__DGSENAB (*((CT__ti_sysbios_heaps_HeapTrack_Module__diagsEnabled *)(xdcRomConstPtr + ti_sysbios_heaps_HeapTrack_Module__diagsEnabled__C_offset)))
#else
#define Module__DGSENAB ti_sysbios_heaps_HeapTrack_Module__diagsEnabled__C
#endif

#undef Module__DGSMASK
#ifdef ti_sysbios_heaps_HeapTrack_Module__diagsMask__CR
#define Module__DGSMASK (*((CT__ti_sysbios_heaps_HeapTrack_Module__diagsMask *)(xdcRomConstPtr + ti_sysbios_heaps_HeapTrack_Module__diagsMask__C_offset)))
#else
#define Module__DGSMASK ti_sysbios_heaps_HeapTrack_Module__diagsMask__C
#endif

#undef Module__LOGDEF
#ifdef ti_sysbios_heaps_HeapTrack_Module__loggerDefined__CR
#define Module__LOGDEF (*((CT__ti_sysbios_heaps_HeapTrack_Module__loggerDefined *)(xdcRomConstPtr + ti_sysbios_heaps_HeapTrack_Module__loggerDefined__C_offset)))
#else
#define Module__LOGDEF ti_sysbios_heaps_HeapTrack_Module__loggerDefined__C
#endif

#undef Module__LOGOBJ
#ifdef ti_sysbios_heaps_HeapTrack_Module__loggerObj__CR
#define Module__LOGOBJ ti_sysbios_heaps_HeapTrack_Module__loggerObj__R
#define Module__LOGOBJ (*((CT__ti_sysbios_heaps_HeapTrack_Module__loggerObj *)(xdcRomConstPtr + ti_sysbios_heaps_HeapTrack_Module__loggerObj__C_offset)))
#else
#define Module__LOGOBJ ti_sysbios_heaps_HeapTrack_Module__loggerObj__C
#endif

#undef Module__LOGFXN0
#ifdef ti_sysbios_heaps_HeapTrack_Module__loggerFxn0__CR
#define Module__LOGFXN0 (*((CT__ti_sysbios_heaps_HeapTrack_Module__loggerFxn0 *)(xdcRomConstPtr + ti_sysbios_heaps_HeapTrack_Module__loggerFxn0__C_offset)))
#else
#define Module__LOGFXN0 ti_sysbios_heaps_HeapTrack_Module__loggerFxn0__C
#endif

#undef Module__LOGFXN1
#ifdef ti_sysbios_heaps_HeapTrack_Module__loggerFxn1__CR
#define Module__LOGFXN1 (*((CT__ti_sysbios_heaps_HeapTrack_Module__loggerFxn1 *)(xdcRomConstPtr + ti_sysbios_heaps_HeapTrack_Module__loggerFxn1__C_offset)))
#else
#define Module__LOGFXN1 ti_sysbios_heaps_HeapTrack_Module__loggerFxn1__C
#endif

